Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/3.0.2/samv70/edc/ATSAMV70N19.PIC
      <edc:SFRDef edc:_addr="0x40020208" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PWM_CH_NUM0PWM0_CDTYUPD" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CDTYUPD" edc:desc="Channel Duty-Cycle Update" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002020C" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWM_CH_NUM0PWM0_CPRD" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CPRD" edc:desc="Channel Period" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020210" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PWM_CH_NUM0PWM0_CPRDUPD" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CPRDUPD" edc:desc="Channel Period Update" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020214" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PWM_CH_NUM0PWM0_CCNT" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CNT" edc:desc="Channel Counter Register" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020218" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWM_CH_NUM0PWM0_DT" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="DTH" edc:desc="Dead-Time Value for PWMHx Output" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DTL" edc:desc="Dead-Time Value for PWMLx Output" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002021C" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PWM_CH_NUM0PWM0_DTUPD" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="DTHUPD" edc:desc="Dead-Time Value Update for PWMHx Output" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DTLUPD" edc:desc="Dead-Time Value Update for PWMLx Output" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020220" edc:access="------------nnnn--nnnnnn----nnnn" edc:cname="PWM_CH_NUM1PWM0_CMR" edc:impl="0xF3F0F" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CPRE" edc:desc="Channel Pre-scaler" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Peripheral clock" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_2" edc:desc="Peripheral clock/2" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_4" edc:desc="Peripheral clock/4" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_8" edc:desc="Peripheral clock/8" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_16" edc:desc="Peripheral clock/16" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_32" edc:desc="Peripheral clock/32" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_64" edc:desc="Peripheral clock/64" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_128" edc:desc="Peripheral clock/128" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_256" edc:desc="Peripheral clock/256" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_512" edc:desc="Peripheral clock/512" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_1024" edc:desc="Peripheral clock/1024" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="CLKA" edc:desc="Clock A" edc:when="(field &amp; 0xF) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="CLKB" edc:desc="Clock B" edc:when="(field &amp; 0xF) == 0xC"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CALG" edc:desc="Channel Alignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPOL" edc:desc="Channel Polarity" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CES" edc:desc="Counter Event Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPDS" edc:desc="Update Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPOLI" edc:desc="Disabled Polarity Inverted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCTS" edc:desc="Timer Counter Trigger Selection" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DTE" edc:desc="Dead-Time Generator Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTHI" edc:desc="Dead-Time PWMHx Output Inverted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTLI" edc:desc="Dead-Time PWMLx Output Inverted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PPM" edc:desc="Push-Pull Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020224" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWM_CH_NUM1PWM0_CDTY" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CDTY" edc:desc="Channel Duty-Cycle" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020228" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PWM_CH_NUM1PWM0_CDTYUPD" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CDTYUPD" edc:desc="Channel Duty-Cycle Update" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002022C" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWM_CH_NUM1PWM0_CPRD" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CPRD" edc:desc="Channel Period" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020230" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PWM_CH_NUM1PWM0_CPRDUPD" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CPRDUPD" edc:desc="Channel Period Update" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020234" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PWM_CH_NUM1PWM0_CCNT" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CNT" edc:desc="Channel Counter Register" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
