Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/3.0.2/samv70/edc/ATSAMV70N19.PIC
      <edc:SFRDef edc:_addr="0x40078230" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="XDMAC_CHID7XDMAC_CUBC" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="UBLEN" edc:desc="Channel x Microblock Length" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40078234" edc:access="--------------------nnnnnnnnnnnn" edc:cname="XDMAC_CHID7XDMAC_CBC" edc:impl="0xFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="BLEN" edc:desc="Channel x Block Length" edc:nzwidth="0xC"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40078238" edc:access="-nnnnnnnnnn-nnnn-nnnnnnnnn-n-nnn" edc:cname="XDMAC_CHID7XDMAC_CC" edc:impl="0x7FEF7FD7" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="TYPE" edc:desc="Channel x Transfer Type" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MEM_TRAN" edc:desc="Self-triggered mode (memory-to-memory transfer)." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PER_TRAN" edc:desc="Synchronized mode (peripheral-to-memory or memory-to-peripheral transfer)." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MBSIZE" edc:desc="Channel x Memory Burst Size" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="The memory burst size is set to one." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FOUR" edc:desc="The memory burst size is set to four." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="EIGHT" edc:desc="The memory burst size is set to eight." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SIXTEEN" edc:desc="The memory burst size is set to sixteen." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DSYNC" edc:desc="Channel x Synchronization" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="PER2MEM" edc:desc="Peripheral-to-memory transfer." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MEM2PER" edc:desc="Memory-to-peripheral transfer." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ" edc:desc="Channel x Software Request Trigger" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="HWR_CONNECTED" edc:desc="Hardware request line is connected to the peripheral request line." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SWR_CONNECTED" edc:desc="Software request is connected to the peripheral request line." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MEMSET" edc:desc="Channel x Fill Block of Memory" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NORMAL_MODE" edc:desc="Memset is not activated." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HW_MODE" edc:desc="Sets the block of memory pointed by DA field to the specified value. This operation is performed on 8-, 16- or 32-bit basis." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSIZE" edc:desc="Channel x Chunk Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="CHK_1" edc:desc="1 data transferred" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CHK_2" edc:desc="2 data transferred" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CHK_4" edc:desc="4 data transferred" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CHK_8" edc:desc="8 data transferred" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="CHK_16" edc:desc="16 data transferred" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DWIDTH" edc:desc="Channel x Data Width" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="BYTE" edc:desc="The data size is set to 8 bits" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HALFWORD" edc:desc="The data size is set to 16 bits" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="WORD" edc:desc="The data size is set to 32 bits" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIF" edc:desc="Channel x Source Interface Identifier" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="AHB_IF0" edc:desc="The data is read through the system bus interface 0." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="AHB_IF1" edc:desc="The data is read through the system bus interface 1." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIF" edc:desc="Channel x Destination Interface Identifier" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="AHB_IF0" edc:desc="The data is written through the system bus interface 0." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="AHB_IF1" edc:desc="The data is written though the system bus interface 1." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SAM" edc:desc="Channel x Source Addressing Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FIXED_AM" edc:desc="The address remains unchanged." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="INCREMENTED_AM" edc:desc="The addressing mode is incremented (the increment size is set to the data size)." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="UBS_AM" edc:desc="The microblock stride is added at the microblock boundary." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="UBS_DS_AM" edc:desc="The microblock stride is added at the microblock boundary, the data stride is added at the data boundary." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DAM" edc:desc="Channel x Destination Addressing Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FIXED_AM" edc:desc="The address remains unchanged." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="INCREMENTED_AM" edc:desc="The addressing mode is incremented (the increment size is set to the data size)." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="UBS_AM" edc:desc="The microblock stride is added at the microblock boundary." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="UBS_DS_AM" edc:desc="The microblock stride is added at the microblock boundary; the data stride is added at the data boundary." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="INITD" edc:desc="Channel Initialization Done (this bit is read-only)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="IN_PROGRESS" edc:desc="Channel initialization is in progress." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="TERMINATED" edc:desc="Channel initialization is completed." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RDIP" edc:desc="Read in Progress (this bit is read-only)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DONE" edc:desc="No active read transaction on the bus." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IN_PROGRESS" edc:desc="A read transaction is in progress." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WRIP" edc:desc="Write in Progress (this bit is read-only)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DONE" edc:desc="No active write transaction on the bus." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IN_PROGRESS" edc:desc="A write transaction is in progress." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PERID" edc:desc="Channel x Peripheral Hardware Request Line Identifier" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4007823C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="XDMAC_CHID7XDMAC_CDS_MSP" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SDS_MSP" edc:desc="Channel x Source Data stride or Memory Set Pattern" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DDS_MSP" edc:desc="Channel x Destination Data Stride or Memory Set Pattern" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40078240" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="XDMAC_CHID7XDMAC_CSUS" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SUBS" edc:desc="Channel x Source Microblock Stride" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
