Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/3.0.2/samv70/edc/ATSAMV70N19.PIC
      <edc:SFRDef edc:_addr="0x400E1824" edc:access="--rrrrrrrrrrrrrr-rr-----rrrrrrr-" edc:cname="SUPC_SR" edc:impl="0x3FFF60FE" edc:nzwidth="0x20" ltx:memberofperipheral="SUPC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WKUPS" edc:desc="WKUP Wakeup Status (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No wakeup due to the assertion of the WKUP pins has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one wakeup due to the assertion of the WKUP pins has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SMWS" edc:desc="Supply Monitor Detection Wakeup Status (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No wakeup due to a supply monitor detection has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one wakeup due to a supply monitor detection has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BODRSTS" edc:desc="Brownout Detector Reset Status (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No core brownout rising edge event has been detected since the last read of the SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one brownout output rising edge event has been detected since the last read of the SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SMRSTS" edc:desc="Supply Monitor Reset Status (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No supply monitor detection has generated a core reset since the last read of the SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one supply monitor detection has generated a core reset since the last read of the SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SMS" edc:desc="Supply Monitor Status (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No supply monitor detection since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one supply monitor detection since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SMOS" edc:desc="Supply Monitor Output Status" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="The supply monitor detected VDDIO higher than its threshold at its last measurement." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="The supply monitor detected VDDIO lower than its threshold at its last measurement." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OSCSEL" edc:desc="32-kHz Oscillator Selection Status" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="RC" edc:desc="The slow clock, SLCK, is generated by the embedded 32 kHz RC oscillator." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CRYST" edc:desc="The slow clock, SLCK, is generated by the 32 kHz crystal oscillator." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="LPDBCS0" edc:desc="Low-power Debouncer Wakeup Status on WKUP0 (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No wakeup due to the assertion of the WKUP0 pin has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one wakeup due to the assertion of the WKUP0 pin has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LPDBCS1" edc:desc="Low-power Debouncer Wakeup Status on WKUP1 (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No wakeup due to the assertion of the WKUP1 pin has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one wakeup due to the assertion of the WKUP1 pin has occurred since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WKUPIS0" edc:desc="WKUPx Input Status (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS1" edc:desc="WKUPx Input Status (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS2" edc:desc="WKUPx Input Status (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS3" edc:desc="WKUPx Input Status (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS4" edc:desc="WKUPx Input Status (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS5" edc:desc="WKUPx Input Status (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS6" edc:desc="WKUPx Input Status (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS7" edc:desc="WKUPx Input Status (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS8" edc:desc="WKUPx Input Status (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS9" edc:desc="WKUPx Input Status (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS10" edc:desc="WKUPx Input Status (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS11" edc:desc="WKUPx Input Status (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS12" edc:desc="WKUPx Input Status (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKUPIS13" edc:desc="WKUPx Input Status (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E1828" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x400E1830" edc:access="-------n---n-nnnnnnnnnnnnnnnnnnn" edc:cname="RTT_MR" edc:impl="0x117FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="RTT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTT">
            <edc:SFRFieldDef edc:cname="RTPRES" edc:desc="Real-time Timer Prescaler Value" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="ALMIEN" edc:desc="Alarm Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTTINCIEN" edc:desc="Real-time Timer Increment Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTTRST" edc:desc="Real-time Timer Restart" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RTTDIS" edc:desc="Real-time Timer Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RTC1HZ" edc:desc="Real-Time Clock 1Hz Clock Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1834" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RTT_AR" edc:nzwidth="0x20" ltx:memberofperipheral="RTT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTT">
            <edc:SFRFieldDef edc:cname="ALMV" edc:desc="Alarm Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1838" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="RTT_VR" edc:nzwidth="0x20" ltx:memberofperipheral="RTT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTT">
            <edc:SFRFieldDef edc:cname="CRTV" edc:desc="Current Real-time Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E183C" edc:access="------------------------------rr" edc:cname="RTT_SR" edc:impl="0x3" edc:nzwidth="0x20" ltx:memberofperipheral="RTT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTT">
            <edc:SFRFieldDef edc:cname="ALMS" edc:desc="Real-time Alarm Status (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTTINC" edc:desc="Prescaler Roll-over Status (cleared on read)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
